[
    {
        "title": "Career & Technical Education",
        "offerings": [
            {
                "title": "BUSINESS ETHICS (CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This semester course will provide a strong foundation in classic and contemporary theory of Business Ethics, using examples and analysis drawn from the workplace, ethical decision-making models, and a focus on self-reflection and moral reasoning. Students explore current American values and establish models as they apply to accounting, finance, marketing, human resource, and management dilemmas. Students will be using a balance of Business Ethics concepts including theory, role-plays, class discussion, and self-reflection activities that make studying ethics rewarding, interesting, and effective. Course topics are designed to focus on ethical issues with regards, but not limited, to: advertising, selling, finance, technology, human resources, personnel, and corporate responsibility."
            },
            {
                "title": "BUSINESS APPLICATIONS (CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This semester course will provide a strong foundation in classic and contemporary theory of Business Ethics, using examples and analysis drawn from the workplace, ethical decision-making models, and a focus on self-reflection and moral reasoning. Students explore current American values and establish models as they apply to accounting, finance, marketing, human resource, and management dilemmas. Students will be using a balance of Business Ethics concepts including theory, role-plays, class discussion, and self-reflection activities that make studying ethics rewarding, interesting, and effective. Course topics are designed to focus on ethical issues with regards, but not limited, to: advertising, selling, finance, technology, human resources, personnel, and corporate responsibility."
            },
            {
                "title": "INTRODUCTION TO BUSINESS (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is eligible for dual credit through ACCC. College credits earned may be transferable to other colleges and institutions. Introduction to Business is specifically designed for the college bound student. Students will explore the American free enterprise system, international/global business, banking and financial management, marketing, human resources, corporate social responsibility and various forms of business ownership. Students will complete a business plan which includes research, to prepare students for the rigors of college research and writing. Students will be able to build their business and leadership skills to develop an understanding of corporate business operations. Involvement in FBLA is encouraged. This course satisfies the NJ State graduation requirement for Financial Literacy."
            },
            {
                "title": "FINANCIAL ACCOUNTING I (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed to teach students the basics in accounting principles corresponding with college courses in Accounting. The course examines the basic accounting cycle, primarily in the context of the sole proprietorship. This course is designed for the student who plans to major in Accounting, Business Administration, Business Management, Finance, Marketing, or Economics is interested in operating their own business. Computers are used to enhance learning and afford the students the knowledge to proceed with a second year in accounting. Involvement in FBLA is encouraged. This course is eligible for dual credit through ACCC. College credits earned may be transferable to other colleges and institutions. Students will also be eligible to earn a certification with successful completion of this course."
            },
            {
                "title": "MANAGERIAL ACCOUNTING II (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Continuing on principles introduced and practiced in Financial Accounting, this course explores in depth the various accounts associated with running a business such as inventory, receivables, liabilities, long-lived assets and analysis of company financial results. Students will also explore accounting for partnerships and limited liability companies and will be introduced to corporations, stock transactions and dividends. This course is eligible for dual credit through ACCC. College credits earned may be transferable to other colleges and institutions."
            },
            
            {
                "title": "Computer Science(CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course is designed for the student who wishes to be introduced to text based programming languages. Students will first learn how to program in Python using a web based programming environment provided by Carnegie Mellon University. During the second half of the year students will transition to the Java programming language. This class proceeds the AP Computer Science A course which focuses solely on programming with Java. Upon completion of this course students will have a basic understanding of two programming languages (Python and Java)."
            },
            {
                "title": "Computer Science(HN)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed for the student who wishes to be introduced to text based programming languages. Students will first learn how to program in Python using a web based programming environment provided by Carnegie Mellon University. During the second half of the year students will transition to the Java programming language. This class proceeds the AP Computer Science A course which focuses solely on programming with Java. Upon completion of this course students will have a basic understanding of two programming languages (Python and Java)."
            },
            {
                "title": "Computer Science(AP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This is an advanced placement computer science course and is taught on a college level in preparation for the Advanced Placement Computer Science Exam. Emphasis will be placed on object oriented programming and basic data structures in the JAVA programming language. Students will develop programs that may be included in an electronic portfolio to demonstrate their programming skills. Upon completion of this course, students will have been exposed to all the concepts they would see in an introductory CS course at the University level. Note: additional out-of-class computer time will be required. Students are required to take the AP exam."
            },
            {
                "title": "Computer Science Principles(AP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This is an advanced placement computer science course for college bound students. Unlike a traditional programming class, this course is more analytical and focuses on the impact of computer science and technology in our everyday lives. The material covered in this course includes units on the internet, digital information, procedural based programming (Java Script), big data & privacy, and app development (Java Script with code.org’s App Lab). Students will be challenged to understand the technologies of today’s world, identifying how technology is making the world a better place but also identifying new concerns and challenges that technology is bringing forth. Researching, writing, and critical thinking are all key elements of the course. The class will use code.org’s AP Computer Science Principles curriculum. Students are required to take the AP exam. At the university level, this course typically maps to an introductory technology course for the non-Computer Science majors."
            },
            {
                "title": "Introduction To Eagles Enterprises(Sp)",
                "grades": "9-10",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed for students to become familiar with entry level job training and pre-vocational skills. In our Eagle Boutique or Eagle Greenery Floriculture I, programs, students will learn how to sort, recycle, inventory merchandise, and stock supplies. Students will learn how to perform assembly line tasks, the importance of teamwork, appropriate means of communication with others, and proper hygiene habits."
            },
            {
                "title": "EAGLE ENTERPRISES II (Sp)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This school-to work transition class is designed to give job training experience in all 3 of our State and National Award winning programs. The Eagle’s Nest School Store, Eagle Eatery, and the Eagle Greenery. Students will be engaged with “hands-on” real life business experiences as they develop generic job skills needed to obtain and maintain employment. The Eagle’s Nest School Store will expose students to areas of retail sales, merchandising, inventory control, daily interaction with customers, and maintaining store appearance. The Eagle Eatery will cover customer service, food preparation, cash register operations, workplace safety, teamwork, and good hygiene in the workplace. The Eagle Greenery Floriculture II, class is designed to develop an understanding of the floriculture industry, establishment and operations of floral shops, and basic elements of floral design and skill."
            },
            {
                "title": "EAGLE ENTERPRISES III (Sp)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The Advanced program is designed to give seniors a working/shadowing opportunity to understand behind the scenes management of offsite businesses in the retail and food industry. Each student, under the direction of the work-study coordinator, will have “shadowing position” in the community for part of the week. This course is designed with a financial literacy component and additional on-premises learning experiences. Students will also gain important leadership skills, marketing and business expertise, which can help to facilitate career options post-graduation."
            },
            {
                "title": "EAGLE ENTERPRISES WORK STUDY (Sp)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed to provide a Community Based Instructional authentic opportunity for students to “Shadow” in predetermined establishments in the surrounding area. This program is available to seniors, once prerequisites are complete and teacher recommendations for the program have been approved. The students will apply life and job skill concepts developed in the Eagle Enterprise Programs in a variety of local establishments. In addition, this course will also include a school based component working in the school copy center. Students will attend career fairs, research the local job industry, complete a functional resume with cover letter and receive training in interview techniques and apply these skills to potential interviews."
            },
            {
                "title": "ENTREPRENEURSHIP (CP)",
                "grades": "10-12",
                "pre-requisite": "None",
                "description": "This course is designed to provide students with the knowledge and skills leading to the development of a business plan for small business ownership. Topics will include marketing strategies, staffing, and financial considerations. Digital marketing and trends in business ownership will be explored. Involvement in FBLA is encouraged."
            },
            {
                "title": "FINANCIAL APPLICATIONS (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Students in this course will discover what it takes to survive in the real world. Purchasing a car, analyzing credit card offers, finding health insurance and making job decisions are just some of the current issues that will be presented to you. Based upon standards outlined by the Jump$tart Coalition for Personal Financial Literacy and endorsed by the Federal Reserve Bank of New York, this course is designed to teach students the art of budgeting, banking, credit, investing and personal risk management. This course satisfies the NJ State graduation requirement for Financial Literacy."
            },
            {
                "title": "FINANCIAL LITERACY (CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "One of the most important skills students can learn as they prepare for college and/or career is successful money management. This course will explore the financial aspects of earning, spending, saving, investing, and protecting the money they acquire. As they learn to become critical consumers, students will gain the knowledge to distinguish between wants and needs and gain the confidence to be able to act responsibly to achieve their short term and long term goals. This course satisfies the NJ State graduation requirement for Financial Literacy."
            },
            {
                "title": "FINANCIAL LITERACY (Sp)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "For students entering the high school, success can mean many things: success in making sound personal choices, success in adapting to high school academic life, success in identifying future goals for college and/or career, success in financial decision making. This course will address the requirements within both the computer/information literacy and the career/technical education standards of the NJ Core Curriculum. Financial Literacy will provide strategies for success for students in their transition to high school and beyond. Course content will include career exploration and financial literacy through advanced technology integration. This course satisfies the NJ State graduation requirement for Financial Literacy."
            },
            {
                "title": "MARKETING (HN)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed for students who wish to pursue a career in marketing, business, entrepreneurship or who simply wish to learn more about consumerism, product promotion, and advertising. In addition to providing fundamental knowledge of national and global marketing, this course will also equip students with entry level competencies in the areas of sports and entertainment marketing. Critical thinking, decision making, project based learning and technology will be used daily to solve problems faced in various business environments. Students will also be introduced to topics and skills in web design and social media as it relates to marketing. Involvement in FBLA is strongly encouraged. This course is eligible for dual credit with ACCC. College credits earned may be transferrable to other colleges and institutions."
            },
            {
                "title": "Web Design I & II (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "In the first semester, students will learn to design, create and maintain professional-looking Web pages using basic HTML and CSS. An initial introduction to lessons will provide students with a general understanding of computers, how the internet works, the web design process, how to acquire web hosting and publish to it, and other concepts that any web designer should be familiar with. Students will then be introduced to the basic concepts of graphic editing and how to prepare images for use on their web pages. Students will also learn how to create quality images from scratch using the concepts that are common in most graphic packages.In the second semester, students will continue learning to design, create and maintain professional-looking Web pages while further developing their skills using HTML5 and CSS3. Students will learn to construct websites that include multiple pages, images, and links. Students will also learn how to lay out content and page elements. During the course, students will create their own website using Adobe Dreamweaver software, on topics such as inspirational people, autobiography and more."
            },
            {
                "title": "Web Design III(CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "In the first semester, students will expand their knowledge on designing, creating and maintaining professional-looking Web pages using HTML, CSS, and JavaScript. Students will be introduced to technologies used in modern web design such as content management systems and WYSIWYG editors. Students will learn to create web sites using a visual editor, from scratch as well as from commercial templates. JavaScript will be used as a tool for creating attractive and efficiently designed websites. The JavaScript focus will teach general programming concepts, yet keeping the design emphasis.In the second semester, students will explore data analytics and social media marketing for business. Students will be exposed to various social media and website business marketing strategies. Using Google Analytics, students will be able to track social media and website hits and present the data to a targeted audience to increase viewership and expand business opportunities.**Upon successful completion of both Web Design courses, students will be eligible to earn W3 Web Certification."
            }
        ]
    },
    {
        "title": "Consumer Science ",
        "offerings": [
            {
                "title": "Child Development I(CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course will study principles and theories of a child’s development from conception to age four. Students will study the impact on the role of family and care-givers in the overall growth and development of a child. This introductory course will focus on the operation of a preschool learning environment. Planning lessons and activities for the three and four year olds will be part of the hands-on experience. Students will be introduced to NJ curricula, including the district adopted Creative Curriculum, and the NJ preschool standards."
            },
            {
                "title": "2. Child Development II(CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course will study principles and theories of a child’s development from birth-middle school years. Teaching pre-K children will be part of the hands-on experience. This class will focus on the classroom environment, creative storytelling and parent communication. The high school student will be independently teaching the young children. Students will be introduced to NJ curricula and the NJ preschool standards. The course will include an introduction to Family, Careers and Community Leaders of America (FCCLA) Career and Technical Student Organization."
            },
            {
                "title": "CHILD DEVELOPMENT III (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is eligible for dual credit through ACCC. College credits earned may be transferable to other colleges and institutions. The students will utilize learned theories and principles in a variety of classroom settings. Students will be provided the opportunity and experience to observe children; relate theories and principles to observed behaviors; design and implement age-appropriate activities for children; and develop skill in-group management. Students may participate in field trips and other events with the students of the preschool program. Students also job shadow at other district schools. Students will be part of Family, Careers, and Community Leaders (FCCLA), a career and technical student organization."
            },
            {
                "title": "TEACHER PREPARATION",
                "grades": "10-11",
                "pre-requisite": "None",
                "description": "Beginning sophomore year, students who are interested in teaching (all grades) as a career have the opportunity to enhance their skills and prepare by participating in the Rowan University Teacher Preparation Academy (TPA) through EHTHS. Students who opt-in to the TPA have the opportunity to earn up to 12 credits towards a bachelor's degree while in high school from their sophomore to senior year. By participating in the academy, students develop the necessary college and career skills through hands-on, experiential learning. The students work directly with preschoolers in a district preschool classroom and with other elementary students. The program includes opportunities for students to engage with Rowan University faculty, events and programs, and other teacher candidates. Students will also have the opportunity to take the Praxis Core Exam before entering collegiate teaching program, potentially having the application fee and/or enrollment fee waived for Rowan University. This program is intended for students who intend to pursue a career in education. Note: (Credits are transferable to other colleges and universities). Students are encouraged to participate in the co-curricular club, Family, Career, and Community Leaders of America (FCCLA) to gain even more practical and leadership experience."
            },
            {
                "title": "CONSUMER AND LIFE SKILLS EDUCATION (SP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course will focus on critical life skills necessary to be functioning members of society. Instruction will target 21st century themes such as critical thinking, problem solving skills; media literacy, and life & career skills. This course will also focus on functional school to work transition skills such as communication, money management, dealing with conflict, assertiveness, self-advocacy, self-monitoring, team building, interviewing skills, resume writing, leadership & responsibility, financial, economic, business and entrepreneurial literacy."
            },
            
            {
                "title": "Culinary Arts",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This introductory Culinary Arts class provides the student with an opportunity to gain knowledge and skill in food preparation during cooking labs. Students will learn basic cooking techniques using recipes. Emphasis on following proper procedures for safety in the kitchen is made a priority. Cooking labs alternate in combination with weekly class work about various food units and nutrition. Family, Career and Community Leaders of America (FCCLA) competitive events, community service, and leadership activities provide the opportunity to apply essential standards and workplace readiness skills through authentic experiences. Students successful in this course will be eligible for recommendation for Culinary Arts II."
            },
            {
                "title": "Culinary Arts II",
                "grades": "11-12",
                "pre-requisite": "Teacher recommendation",
                "description": "This is a course for the student seriously interested in food preparation and/or pursuing the culinary arts in college or for a career. Students will refine skills and techniques during cooking labs and experiment with advanced food preparation techniques including sauces, pastries, and soups. Students will prepare dishes from different regions of the United States and from around the world. Cooking labs alternate in combination with weekly class work about various food units and nutrition. Family, Career and Community Leaders of America (FCCLA) is encouraged as competitive events, community service, and leadership activities provide the opportunity to apply essential standards and workplace readiness skills through authentic experiences. Students successful in this course will be eligible for recommendation for Culinary Arts III. **Students are eligible to earn the National Restaurant Association’s ServSafe Food Handler course and certification."
            },
            {
                "title": "Culinary Arts III",
                "grades": "11-12",
                "pre-requisite": "Teacher recommendation",
                "description": "This is a course for the student seriously interested in food preparation and/or pursuing the culinary arts in college or for a career. Students will refine skills and techniques during cooking labs and experiment with advanced food preparation techniques including sauces, pastries, and soups. Students will prepare dishes from different regions of the United States and from around the world. Cooking labs alternate in combination with weekly class work about various food units and nutrition. Family, Career and Community Leaders of America (FCCLA) is encouraged as competitive events, community service, and leadership activities provide the opportunity to apply essential standards and workplace readiness skills through authentic experiences. Students successful in this course will be eligible for recommendation for Culinary Arts III. **Students are eligible to earn the National Restaurant Association’s ServSafe Food Handler course and certification."
            },
            {
                "title": "Fashion & Design Technology I ",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "The Fashion and Design Technology I course is designed to expose students to hands on, clothing design and construction where students will use modern equipment and technology software to create clothing design ideas. The students will be exposed to the fashion industry and concepts of material, lines, and design techniques in clothing and accessories. The students will start with sketch drawings, advance to software design, and further expand their designs into textiles and clothing construction techniques, which will enable students to create personalized garments. The students will also gain an understanding of various careers in fashion."
            },
            {
                "title": "Fashion & Design Technology I ",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "The Fashion and Design Technology I course is designed to expose students to hands on, clothing design and construction where students will use modern equipment and technology software to create clothing design ideas. The students will be exposed to the fashion industry and concepts of material, lines, and design techniques in clothing and accessories. The students will start with sketch drawings, advance to software design, and further expand their designs into textiles and clothing construction techniques, which will enable students to create personalized garments. The students will also gain an understanding of various careers in fashion."
            },
            {
                "title": "Fashion & Design Technology II ",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The Fashion and Design Technology I course is designed to expose students to hands on, clothing design and construction where students will use modern equipment and technology software to create clothing design ideas. The students will be exposed to the fashion industry and concepts of material, lines, and design techniques in clothing and accessories. The students will start with sketch drawings, advance to software design, and further expand their designs into textiles and clothing construction techniques, which will enable students to create personalized garments. The students will also gain an understanding of various careers in fashion."
            },
            {
                "title": "INTERIOR DESIGN (CP) ",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The Fashion and Design Technology I course is designed to expose students to hands on, clothing design and construction where students will use modern equipment and technology software to create clothing design ideas. The students will be exposed to the fashion industry and concepts of material, lines, and design techniques in clothing and accessories. The students will start with sketch drawings, advance to software design, and further expand their designs into textiles and clothing construction techniques, which will enable students to create personalized garments. The students will also gain an understanding of various careers in fashion."
            },
            {
                "title": "INDEPENDENT LIVING (SP)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course will allow students to learn skills valuable to living on their own. While learning to be wise consumers, students will explore the economy, grocery and clothing shopping, transportation choices, housing options, credit, finances and financial institutions, saving and insurance. Careers and entrepreneurship will be discussed and various community resources and guest speakers will enhance the program."
            }
        ]
    },
    {
        "title": "Industrial Technology  ",
        "offerings": [
            {
                "title": "AUTOMOTIVE TECHNOLOGY I",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "The student will study the automotive industry with emphasis on employment possibilities and utilize the Internet for additional automotive technologies. Hands-on experiences with a focus on STEAM enhances the learning situation for the student in the trouble-shooting practice sections. These sessions are designed to prepare the student for practical application of the information learned in class. Students will be instructed how to properly maintain and repair their personal vehicles. A logical approach, patience, and safety are strongly stressed. To remain in this course, students are required to pass a written safety test and OSHA (Occupational Safety and Health Administration) certifications in Automotive Safety and Automotive Pollution Prevention by the middle of the 1st marking period."
            },
            {
                "title": "AUTOMOTIVE TECHNOLOGY II",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The student will continue with their study of the automotive industry with emphasis on employment possibilities and utilize the Internet for additional automotive technologies. Hands-on experiences utilizing STREAM and more advanced automotive diagnostic technologies will be the focus of troubleshooting practice sections. These sessions are designed to prepare the student for practical applications of the information learned in class. Students will be instructed on shop safety and how to properly maintain personal vehicle as well as those of the faculty staff and community members. A safe and logical approach is strongly stressed. To remain in this course, students are required to pass a written safety test and OSHA (Occupational Safety and Health Administration) certifications in Automotive Safety and Automotive Pollution Prevention by the middle of the 1st marking period."
            },
            {
                "title": "AUTOMOTIVE TECHNOLOGY III",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The class is designed for a student with a strong desire to enter the Transportation Industry after graduation. The course may be taken simultaneously with Automotive Technology II to allow for additional lab time. Students will further develop hands-on practical skills focusing on automotive diagnostics and STREAM in preparation for post-graduation opportunities and educational pursuits. Students will be instructed on shop safety and how to properly maintain personal vehicle as well as those of the faculty staff and community members. A safe and logical approach is strongly stressed. To remain in this course, students are required to pass a written safety test and OSHA (Occupational Safety and Health Administration) certifications in Automotive Safety and Automotive Pollution Prevention by the middle of the 1st marking period. Throughout the duration of this year-long course, students will have opportunities to earn Automotive Service Excellence (ASE) Entry Level Certification in a wide-variety of automotive systems and diagnostic skills, as well as national, industry-standard OSHA 10 certification.."
            },
            {
                "title": "ELECTRICAL TECHNOLOGY I (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Electrical Technology will take your interest in electrical wiring to a level that allows you to design digital circuits by converting word problems into digital equations that can be simplified with Boolean Algebra into a simple equation where both equations (original and simple) receive data inputs that correlate numerically to sequences that are built, tested, and reduced as minterm/maxterm results. The permanent skill level will advance the interested student into an array of challenges using basic electronics, motor controls and the manual skills needed to install and maintain electrical wiring in homes and commercial buildings. Students develop skills in bending conduit, wiring circuit breaker panels, laying wire, operating motor controls, installing equipment and testing final installations. Students also learn to design and install electric heating systems, motor controls, and interior lighting systems that successfully pass rough and final inspections. Other topics covered include circuitry for fluorescent lighting systems, NEC code requirements to design and complete wiring circuits found in the home. State of the art Automation Technology is used to train students to design smart homes. Students are also trained on the theory and ladder logic programming of Programmable Logic Controllers with the vital role that contribute to our nation's STREAM core."
            },
            {
                "title": "ELECTRICAL TECHNOLOGY II (CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "A fundamental working knowledge of electrical technology is required to enroll in Electrical Technology II. Electrical Technology II will teach you how to install electrical service devices that passes inspection by a local municipality. Electronic testing will also focus on advanced circuit design which could be useful for future employment. Students are encouraged to research and specialize in one area of the industry that presents a competitive approach to a learned and demonstrated design skill. Students are encouraged to participate in STEAM events that have longevity in science and engineering. In particular, anyone desiring a careers in telecommunications, electrical design, or electronic product development will enjoy this course. The Electrical programs will train you for gainful employment and the basic requirements eventually needed to obtain NJ State Certifications."
            },
            {
                "title": "ENGINEERING DESIGN with CAD I (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Engineering Design and Modeling I introduces students to the world of 3D drawings. They will use OnShape, a tool used by professionals and hobbyists alike, to design, animate, and 3D print objects to be used in the real world. Students will also use LEGO Mindstorm to create complex assemblies designed to achieve various tasks The class focuses on the engineering design loop. This course would be beneficial for those who wish to pursue engineering in post-secondary education and/or professionally."
            },
            {
                "title": "ENGINEERING DESIGN with CAD II (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Engineering Design II builds upon the knowledge and skills acquired in Level I. Students will learn more advanced CAD techniques, such as drawing screw threads and lofted parts. They will be given more freedom in terms of their designs, and have the chance to see their creations brought into the real world. Level II will also include Mechanical Design, a field which focuses on creating working parts that can be manufactured and achieve various tasks. This course is eligible for dual credit with Stockton University."
            },
            {
                "title": "ENGINEERING DESIGN WITH CAD III (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Engineering Design and Modeling Level III continues to pose new challenges to the students who have committed to learning the design loop. The class will focus heavily on design challenges, where students are given a problem and tasked with finding the best solution. They will take the problem from start to finish, starting with brainstorming possible solutions to testing their final product. These products will be judged by professionals, who have faced similar challenges in their own careers. This class will prepare students for post-secondary and professional engineering. *Students are eligible to take the Solid Works certification test with completion of this course and pre-requisites."
            },
            {
                "title": "Robotics(CP) ",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "Robotics Engineering Technology is a course designed to let students engage and explore the real world of robotics engineering. This course will focus on students working in groups to design, build, and code robots to meet various specifications. The focus of this course is VEX robotics where students will learn the C++ coding language, which is standard programming language used in industry for robotics engineering. This course will also support students in the development of critical thinking, time management, collaboration, and engineering design skills. Students will also explore the development of robotics technology from the past to the present and explore careers in the field of robotics."
            },
            {
                "title": "GRAPHIC ARTS TECHNOLOGY I ",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course provides the student with the basic fundamentals of computerized graphics using the Power Macintosh computer. By utilizing the system that is foremost among graphic designers today, career opportunity becomes an attainable transition. Silkscreen printing and laser printing for T-shirts, posters, business cards, flyers, brochures, memo pads, resumes and various forms of printable material will be taught in the form of graphic design. Digital photography may be utilized in the production of all graphic projects. Students will learn how to implement digital and original art by using digital cameras, scanners and the very latest Adobe software including: Photoshop, Illustrator, and Indesign. Students will develop skills used in promotion and retail sales by using the dye sublimation printing process to produce various commercial items including mugs, shirts, hats, and more. The study of graphic design is an excellent tool for any student considering yearbook design and journalism as it gives full hands-on approach in laying out text and graphic."
            },
            {
                "title": "GRAPHIC ARTS TECHNOLOGY II ",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is a continued study of Graphic Arts I that provides the student with the basic fundamentals of computerized graphics utilizing computers, high-end laser printers, specialized large format printers and professional power-paper publication cutter for commercial applications. Digital or traditional photography may be utilized in the production of all graphic projects. Students will learn how to implement digital and original art by using digital cameras, scanners and the very latest Adobe software. It is an advanced study course in which the student takes the skills he or she has learned in Graphic Arts Tech I and is challenged with more complex projects and assignments utilizing advanced techniques in layout, screen process printing, and dye sublimation for the production of material for school clubs and activities"
            },
            {
                "title": "NETWORKING I WITH PC SYSTEMS (CP) ",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This course introduces the student to the underlying concepts of data communications, telecommunications and networking. It provides a conceptual view of networking fundamentals & local area networks and will bring together the acronyms, protocols, and components used in today's networks. It is the fundamental portion of the Advanced Certificate in Computer Networking, designed specifically to provide the student with a practical and comprehensive working knowledge of networking. A hands-on approach, students will construct and maintain a classroom network. Note: Networking I and Networking II are designed to prepare students to take the NOCTI-Computer Networking Fundamentals Certification Test."
            },
            {
                "title": "NETWORKING II WITH PC SYSTEMS (CP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed to provide the student with conceptual and working knowledge of how Local Area Networks communicate over a wide area and the four important networking architectures in corporate environments today, TCP/IP, SNA, AppleTalk and DNA. Students will learn concepts that are important to the field of systems integration, as well as a conceptual basis for understanding network architecture. A hands-on approach, students will consult, construct and maintain various networks for other classroom networks. Note: Networking I and Networking II are designed to prepare students to take the NOCTI – Computer Networking Fundamentals Certification Test. *Students are eligible to complete the A+ certification test upon successful completion of Networking II and pre-requisites."
            },
            {
                "title": "PC SYSTEMS SERVICING",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "The PC Systems Servicing and Training course provides an introduction to PC technology. This course describes what a PC is, how it works and the operating system that controls it. Starting with the basics, students will learn about components that make up a PC, take basic measurements using a digital multimeter, develop a mastery of industry standard operating systems and learn basic system troubleshooting with hands-on exercises. Students will build a computer utilizing various hardware and software. Students will study advanced techniques for evaluating, isolating and identifying several malfunctions down to the board, module or configuration level. Students, using an interactive, windows-based program, will apply the skills and knowledge gained to prepare them for the A+ certification test."
            },
            {
                "title": "PHOTOGRAPHY",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course will be introducing the applications that relate to the preparation of printed materials. Students will learn the basics of DSLR photography. Using Photoshop students will make adjustments to their images and produce original graphics. The use of Photoshop and project-based learning activities will be used to relate concepts used in the communication industry to the classroom. Students will be exposed to career concepts regarding photography as well as develop a lifelong love of the pursuit."
            },
            {
                "title": "PRE-APPRENTICESHIP PROGRAM",
                "grades": "12",
                "pre-requisite": "None",
                "description": "This course is specifically designed for the senior students who want to get a jump start on careers. Students enrolled in this program will have an opportunity to engage in careers including manufacturing, wastewater management, medical assistant, information technology, and more. The students will participate in in-class online modules related to the respective field as well as engage in hands-on training by experienced professionals in the field. As part of the program, students enrolled in this program may spend two periods or more participating in related training for the field either on school campus or at the training site. Students who participate in the manufacturing program will gain an industry- recognized credential that will allow them to progress into the full-apprenticeship program upon graduation. Students who continue with the manufacturing experience after graduation are matched with employers to gain related-technical experience and the credentials that are required to work in the field."
            },
            {
                "title": "WOOD TECHNOLOGY I",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This is an introductory course in which students will learn basic woodworking techniques, wood identification, safe use of various hand and power tools as well as fabrication techniques. Students will use multiple forms of woodworking plans such as sheet plans, custom plans and custom plans they design themselves with orthographic projection. Emphasis will be on safety procedures, use of tools, materials, and completion of required project assignments. Students will learn and use CNC equipment in an introductory matter. To remain in this course, students are required to pass a written safety test at the beginning of the 1st marking period."
            },
            {
                "title": "WOOD TECHNOLOGY II",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Wood ll is an advanced woodworking course for students who are interested in refining their woodworking skills. Each student will design and create his/her own projects using the Internet, Computer Aided Drafting (CAD) and the Engineering Design Process. Advanced machine techniques such as (CNC) Computer Numerical Control Router/Engraving, wood lamination, wood sculpture and finishing procedures will be covered in this course. Emphasis will be placed on quality of work and originality of ideas and recognition of safety procedures. To remain in this course, students are required to pass a written safety test at the beginning of the 1st marking period.."
            },
            {
                "title": "WOOD TECHNOLOGY III",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Wood llI is an advanced woodworking course for the student who is interested in further advancing their woodworking skills. Each student will have to construct an introductory project using an inlay technique then they will design and create their projects using the Internet, Computer Aided Drafting (CAD), and the Engineering Design Process. Advanced machine techniques such as (CNC) Computer Numerical Control Router/Engraving machines, wood lamination, wood sculpture and finishing procedures will be covered in this course, as well as wood bending techniques. The course will also offer more advanced CNC techniques. Emphasis will be placed on project management, quality of work and originality. To remain in this course, students are required to pass a written safety test at the beginning of the 1st marking period."
            },
            {
                "title": "ELECTRICAL ENGINEERING (HN) ",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course takes previously learned talents of a mathematically-inclined student and applies numerical skill to creative engineering. The student in this program is considering engineering as a “career skill” by employing academic components that develop analytical platforms which promulgate the talents of global markets. With unique levels of thought, students learn to convert highly-technical word problems into math equations that satisfy the conditions of an “original equation” which when simplified, using laws of Boolean algebra and DeMorganization, impose theoretical implications onto the reality of a design. The student designer is required to perform a hardware analysis to determine cost advantages of simplifications and outline the best approach to fabricate. Projects focus on many aviation-related topics and all designs are required to be tested with valid input in the appropriate number system that sustains credible results."
            },
            {
                "title": "INTRO to FLIGHT(CP,HN)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "In this Introduction to Flight Course, students will begin with an exploration of the types of aircraft in use today before going on to learn how aircraft are made and how they fly. Students will understand how aircraft are categorized, be able to identify their parts, and learn about aircraft construction techniques and materials. They will gain an in-depth understanding of the forces of flight—lift, weight, thrust, and drag—including how to make key calculations. They will then touch on aircraft design, looking at stability, aircraft controls, and maneuvering flight. The course will conclude with a focus on career skills related to these topics. Students will be introduced to co-curricular aviation events and organizations where junior flight opportunities and entry level certifications are offered. Honors level is for students in the Aviation Program Track."
            },
            {
                "title": "AVIATION WEATHER (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This semester course introduces students to the reading and interpretation of weather reports and charts as well as theories of meteorological processes and their impact on aviation. Students will analyze weather factors decisive to safe flight operations. Topics include but are not limited to aviation weather fundamentals, atmospheric circulation systems, aviation weather resources and weather hazards."
            },
            {
                "title": "AERONAUTICAL KNOWLEDGE (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This semester course introduces students to the basic knowledge necessary to function safely and competently in the flight environment. Topics include, but are not limited to airplane components, aerodynamics principles of flight, aircraft instruments and systems,performance prediction, and weight and balance control. This course introduces students to the flight environment including airports, airspace, aeronautical charts, ATC services, navigation aids, VFR and FR operations, approach and departure procedures, FAA regulations, and the Airman’s Information Manual. Additionally, the course covers basic weather theory, weather and forecast reports, pilotage, dead reckoning, communication procedures, flight planning, decision making, human factors and aviation physiology."
            }
        ]
    },
    {
        "title": "English",
        "offerings": [
            {
                "title": "ENGLISH I (HN, ADV, CP)",
                "grades": "9",
                "pre-requisite": "Teacher Recommendation",
                "description": "All areas and skills of the language arts will be studied. Reading and writing for application and the processing of information with emphasis on content analysis and written expression and style will provide the student with a base for further challenging study. This course will explore world literature from early creation myths and stories through contemporary novels that depict different cultures. The course will focus on reading and writing strategies to extract pertinent information from literature and informational texts. Through various genres, students will focus on universal themes that promote ethics, choices and empathy. Students in all levels of English I will be required to take the PARCC ELA 09 assessment."
            },
            {
                "title": "ENGLISH I (SP)",
                "grades": "9",
                "pre-requisite": "None",
                "description": "All areas and skills of the language arts will be studied. This course will emphasize the acquisition of skills needed in language, literature and communication. Reading for appreciation and information and the study of grammar, usage and mechanics for improved written expression will provide the student with the base for further challenging study. A vocabulary program, use of the library, speaking and listening skills and study habits will round out this curriculum. Students will be required to take the PARCC ELA 09 assessment."
            },
            {
                "title": "ENGLISH II (HN, ADV, CP)",
                "grades": "10",
                "pre-requisite": "HN/ADV Teacher Recommendation",
                "description": "All areas and skills of the language arts will be studied. Greater emphasis will be applied to literary analysis and information process writing based upon a literary core. This course will focus on four thematic units: Race, Morality, Gender and Class. There will be a focus on the historical and social context to teach students to approach literature with a critical lens. The development of analytical writing will be a major focus as well as integrating primary resources and research. Students in all levels of English II will be required to take the NJSLA ELA 10 assessment."
            },
            {
                "title": "ENGLISH II (SP)",
                "grades": "10",
                "pre-requisite": "None",
                "description": "All areas and skills of the language arts will be studied. English ll further develops the skills practiced in English I. Reading of more complex selections and differentiation of the types of literature in fiction and non-fiction will be stressed. Language study will continue on a higher level. A vocabulary program, use of the library, speaking and listening skills, and study habits will be further developed as well. Sample texts include, Hugh Pentecost’s “A Kind of Murder,” excerpts from Martin Luther King’s speeches, and the novels Tears of a Tiger and Breathing Underwater. Students enrolled in English II will be required to take the NJSLA ELA 10 assessment."
            },
            {
                "title": "ENGLISH III: LANGUAGE & COMPOSITION (AP)",
                "grades": "11",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is geared to the conscientious student who wishes to be eligible for college credit in English. Students focus on nonfiction prose such as essays, sermons, and oratory of various chronological periods. Students will learn how to shape their language in a variety of rhetorical patterns so that diction serves its purpose and audience. Students will also learn how to explain how one's choice of language produces intended effects. Reading proficiency will include recognizing the conventions of different genres and periods of time as well as identifying assumptions authors have made about their audiences. Students are required to take the AP exam."
            },
            {
                "title": "ENGLISH III (HN, ADV, CP)",
                "grades": "11",
                "pre-requisite": "HN/ADV Teacher Recommendation",
                "description": "All areas and skills of the language arts will be studied. Language study will continue on a higher level. This course will take a thematic approach to American Literature and incorporate contemporary novels and writings. Thematic topics explored may include: The American Dream, Justice and Injustice, Conformity, Identity and Morality. Students will continue to focus on analytical and expository writing and speaking. Completion of an analytical research paper is a requirement for this course. Students enrolled in all levels of English III will be required to take the NJSLA ELA 11 assessment."
            },
            {
                "title": "ENGLISH III ( SP)",
                "grades": "1q",
                "pre-requisite": "None",
                "description": "All areas and skills of the language arts will be studied. English III further develops the skills practiced in English II including vocabulary study and composition procedures. This course places emphasis on a chronological survey of American Literature. Course content includes business letters, applications, forms and technical material. Students enrolled in English III will be required to take the NJSLA ELA 11 assessment."
            },
            {
                "title": "ENGLISH IV: LITERATURE AND COMPOSITION (AP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "AP English Literature and Composition course aligns to an introductory college-level literary analysis course. The course engages students in the close reading and critical analysis imaginative literature to deepen their understanding of the ways writers use language to provide both meaning and pleasure. As they read, students consider a work’s structure, style, and themes, as well as its use figurative language, imaginary, symbolism and tone. Writing assessments include expository, analytical and argumentative essays that require students to analyze and interpret literary works. This is a writing intensive course. Writing proceeds through several stages of drafts with revision aided by teachers and peers. Students are required to take the AP exam."
            },
            {
                "title": "ENGLISH IV (HN, ADV, CP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course will focus on the necessary literary skills students will need in order to be successful in college. Reading of more complex selections and differentiation of the types of literature will be stressed. The focus of the course will be on Global Awareness and preparing students for life beyond high school. Students will be exposed to relevant and complex literature and informational texts to build reading, writing, speaking, and communication skills. Students will be offered choice in their research and reading lives. A majority of the work will focus on application of literacy skills to real world experiences and project based learning."
            },
            {
                "title": "ENGLISH IV ( SP)",
                "grades": "12",
                "pre-requisite": "None",
                "description": "All areas and skills of the language arts will be studied. This course will emphasize writing skills and vocabulary skills to a greater depth. Poetry, short stories, and novels read in this course will focus on literature from around the world. Students will study works that include a variety of authors from both the Eastern and Western Hemispheres."
            },
            {
                "title": "ENGLISH LAB ",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "English Lab is a supplemental course designed to improve basic reading and writing skills utilizing an instructional program known as READ 180. The program, designed by Scholastic Inc., provides interventions for students experiencing difficulty with Language Arts by employing a combination of multimedia applications, small group and individualized instruction. English I emphasizes the acquisition of skills needed in language, literature and communication. Skills in reading, process writing, grammar, usage and mechanics will be the focus of study. A vocabulary-building program will be followed with additional units in using the library, speaking, listening and studying. The results of individual scores on READ 180 assessments will determine students’ focus in the course."
            },
            {
                "title": "WRITING & LITERACY LAB (B) ",
                "grades": "9-10-11",
                "pre-requisite": "None",
                "description": "This semester course is a targeted intervention to assist students in the skills tested on the PARCC (College and Career Readiness) Assessments. Students will work in a setting that provides a low student/teacher ratio. The low student/teacher ratio is optimal for addressing specific areas of deficit in reading comprehension, as well as writing. Data on student skill deficits will be tracked throughout the semester. The online program, Study Island, will provide opportunities to identify, as well as address various issues relating to reading and writing skills. Overall, this course will increase students’ propensity for success in future College and Career endeavors. Placement into this course will be determined by results on previous NJSLA Assessments and/or other school-based assessments."
            },
            {
                "title": "ORTON-GILLINGHAM READING",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course teaches total word construction through an interactive, multi-sensory approach. Language is taught in a systematic, cumulative manner for both decoding and encoding words. The course also emphasizes strengthening sight vocabulary and reading fluency in order to improve comprehension, thus enabling our students to read more efficiently."
            },
            {
                "title": "SUPPLEMENTAL STUDY",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This full year course will assist the classified student with their academic classes. Approval for this class is given on an individual basis by the recommendation of the Child Study Team. The student receives help in a variety of subjects. The course provides study skill development as well as the support required to become successful in general education classes. Students are graded on a pass/fail basis and must be prepared to complete assignments and improve work habits, organizational skills and time management skills."
            },
            {
                "title": "AFRICAN-AMERICAN STUDIES(CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course is designed for students who are interested in examining and exploring film, literature, and art on topics relevant to the African American cultural experience beginning with the onset of the African Diaspora and continuing through present day. Students will study the evolution of artistic expression from an African-American point of view, including the introduction of Africans to the Americas, enslavement, emancipation, and the social and political challenges and triumphs that followed and persist. Films and literature include: 12 Years a Slave, Malcolm X, Amistad, Do the Right Thing, The Butler, Rosewood, Black Panther, Get Out, The Color Purple, The Help, The Bluest Eye, Invisible Man, and many more."
            },
            {
                "title": "AP SEMINAR",
                "grades": "10-11",
                "pre-requisite": "Teacher Recommendation",
                "description": "Students will develop their analytical skills by exploring appropriate themes and topics selected by the teachers and the students. Students will learn to synthesize information from multiple sources, develop their own perspectives in research- based essays, and design oral and visual representations. Students will be expected to complete an individual paper, presentation and end of course exam as well as a team research project. These benchmark assignments will be submitted to the College Board and contribute to the final AP score. Students are required to take the AP Exam."
            },
            {
                "title": "AP RESEARCH",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "In AP Research, students explore various research methods and complete an independent research project. The project can build on a topic, problem, or issue covered in AP Seminar or on a brand new topic of students’ choosing. At the end of the project, students submit an academic paper and present and defend their research findings. These components contribute to the overall AP Research score. There is no end-of-course exam. Students who score 3 or higher in AP Seminar and AP Research and score 3 or higher on 4 additional exams (throughout high school) will be eligible for the AP CAPSTONE diploma."
            },
            {
                "title": "CREATIVE WRITING (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Creative Writing is designed to offer the student valuable experience in developing original works of literature, self- expression and creativity. By using student writings and professional models from poets such as Yusef Komunyakaa and Sylvia Plath and fiction writers such as Sandra Cisneros and Chinua Achebe, students will develop original works of creative writing, including short story writing, writing a novel, and experimenting with many forms of poetry. The student will also learn the steps in the writing process."
            },
            {
                "title": "CREATIVE WRITING II (CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed to take the student writer into a closer examination of the writing process through the development and radical revision of original works of poetry, fiction and playwriting. Students will read and write essays on craft and examine the different mediums to express original writing, including publication of their own work. Students will also run a call for submissions of original writings and artwork by their peers, edit, design and produce a virtual journal for the student body."
            },
            {
                "title": "GREAT FILMS/GREAT BOOKS (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course should appeal to any and all students who love to watch movies. Students will learn to analyze filmic elements that compose a great film, and make comparisons with literary elements that occur in good story. In developing an ability to read the language of movies, students will improve their understanding of the ways texts create meaning. Through analysis of the technical, visual, and auditory components of film, students will become more adept at analyzing theme and film as well as literature and other media. Students will analyze filmic technique such as camera angels, framing, lighting, music, narration perspective, chronology, climax, foreshadowing, action, costumes, props, casting, and settings-basically everything that goes into movie making. Movies include: The Shawshank Redemption, Donnie Darko, Edward Scissorhands, The Godfather, The Dark Night, Million Dollar Baby, Rebel Without A Cause, The Shining, Wonder Woman and many more."
            },
            {
                "title": "YEARBOOK (CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course gives students experience in interviewing, writing, and electronic production as they produce the school yearbook. Students will develop thematic verbal and visual design and create a cover concept. Students will brainstorm story ideas, develop them through writing, and capture them through digital photography. The students will utilize design software to produce a memorable publication."
            },
            {
                "title": "JOURNALISM I (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Students will learn the basics of both print and broadcast journalism by selecting, writing and presenting information for school publications and EHT-TV. Students will study news, feature and editorial writing, proofreading, headlining and page makeup and apply their knowledge to the production of the school newspaper. Interviewing and basic photojournalism will also be covered. For broadcast, students will make content decisions based on audience, purpose and journalistic concerns. They will write scripts that are clear, concise and focused for the ear. They will respond appropriately to cues, utilize correct posture, and maintain eye contact with the camera while broadcasting. They will enunciate clearly with appropriate facial gestures and vocal expression."
            },
            {
                "title": "MEDIA I (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This college prep course is a foundational course that will deal with all aspects of video production and film appreciation. Students will gain hands on experience with video cameras and Apple based editing systems. Students will be responsible for supplementing video projects for Eagle News, our morning news show."
            },
            {
                "title": "MEDIA II (CP) ",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Media II is an audio/video technical class that focuses on the production of Eagle News. Students are expected to perform all tasks needed for the production of a news based television show that will broadcast each day to the student body. Students will write, shoot and edit “stand alone” news features included in our daily broadcast."
            },
            {
                "title": "PHILOSOPHY (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "In this course, students will delve into their own truly sought after questions in life, examine philosophical texts, as well as engage in interesting discussions and debates while determining the values that color their experience of the world. The issues students will examine through the lens of famous philosophers including Plato, Aristotle, Mill, Kant, Lao Tzu, Confucius, Nietzsche and Camus will be demonstrated through film and literature. Focal points of examination will include reality, death, the meaning of life, how one ought to live, and what stepping out of “the cave” of ignorance translates to in terms of social and political philosophy. The aim of this course is for students to develop a more fulfilling and inspired way of living life through the philosophies they construct. This course is eligible for dual credit through ACCC. College credits earned may be transferable to other colleges and institutions."
            },
            {
                "title": "PRINCIPLES OF MULTIMEDIA PRODUCTION (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The essential objective is to develop the students’ creative capacities and to introduce students to the practical concerns in the making of film style single camera productions. The goal of the course is to develop professional skills and knowledge in the areas of: scriptwriting, directing, filming, audio, lighting, and editing. Students gain hands-on experience in lighting, filming, audio recording and computer based editing and assume roles in the pre through post production processes. Students will create a final video project of their own design. Formal assessments will be based on the assigned text. This course is eligible for dual credit through Stockton University. College credits earned may be transferable to other colleges and institutions."
            },
            {
                "title": "SPORTS AND INFORMATION MEDIA (CP))",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This course trains students to produce sports broadcasts and sports studio shows. Students work behind and in front of the camera, in production and on-air rolls. They do background research and conduct interviews to identify story lines. They prepare depth charts and memorize key information and statistics for on-air rolls. They write scripts and create run downs and graphics. They promote the broadcast on various social media platforms. They research, report, shoot and edit video profiles and enterprise stories. They also study the history of sports broadcasting and sports media partnerships and analyze industry trends."
            },
            {
                "title":"WORLD MYTHOLOGY (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course focuses on major myths from around the world including creation, fertility, and hero myths. Cross-cultural comparisons and similarities will be examined as well as issues that unite human beings around the globe and through time. Mythology will include myths from Rome, Greece, the Middle East, Europe, the British Isles, the Far East, and the Americas."
            },
            {
                
                "title":"ETHICS THROUGH FILM(CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This is an introduction to the study of the meaning of human conduct with emphasis on the critical analysis of the principal ethical theories. Basic problems and applications of philosophical ethics and how they relate to the problems of the individual and community are examined through the study of multicultural and multidiscipline works of classical and modern thinkers/philosophers. Meets General Education requirement for Humanities. (2003)"
            }
        ]
    },
    {
        "title": "Health & Physical Education",
        "offerings": [
            {
                "title": "ADAPTIVE PHYSICAL EDUCATION",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed for students with physical and/or emotional limitations. Individual programs are designed for each student, according to their abilities. Students are referred by the youth study team, and/or guidance counselor based on their IEP or 504 plan. Students explore and learn fundamental skills in health related concepts, team sports, recreational games, leisure activities, and physical conditioning."
            },
            {
                "title": "HEALTH/PHYSICAL EDUCATION I",
                "grades": "9",
                "pre-requisite": "None",
                "description": "This course is required for all 9th grade students. This program includes, but not limited to, units in team sports, physical conditioning, track and field, field hockey, team handball, Project Adventure, bicycle safety, lacrosse, flag football, soccer and swimming. Health topics include Family Life Education, social, physical and mental health."
            },
            {
                "title": "HEALTH/PHYSICAL EDUCATION II",
                "grades": "10",
                "pre-requisite": "None",
                "description": "This course is required for all 10th grade students. This program includes, but not limited to, units in team sports, physical conditioning, track and field, field hockey, team handball, Project Adventure, wrestling, bicycle safety, flag football, soccer and swimming. Health topics include driver education, decision making, and health careers."
            },
            {
                "title": "HEALTH/PHYSICAL EDUCATION III",
                "grades": "11",
                "pre-requisite": "None",
                "description": "This course is required for all 11th grade students. This program includes, but not limited to, units in softball, volleyball, aerobics, weight training, team handball, archery, tennis, basketball. Health topics include drug education, CPR/AED, and first aid/safety."
            },
            {
                "title": "HEALTH/PHYSICAL EDUCATION IV",
                "grades": "12",
                "pre-requisite": "None",
                "description": "This course is required for all 12th grade students. This program includes, but not limited to, units in tennis, volleyball, indoor/outdoor recreational games, floor hockey, physical conditioning, softball, golf, basketball. Health topics include drug education, nutrition, health relationships, conflict resolution, mental health, preventing violence/abuse and health careers."
            },
            {
                "title": "STRENGTH & CONDITIONING",
                "grades": "11-12",
                "pre-requisite": "None",
                "description": "This full year class will give students an opportunity to increase sport specific endurance, strength, and flexibility thus providing a foundation for intensive training and maximal athletic efforts. Participation in this class will also reduce the risk of injuries by improving physical fitness and skill acquisition. Students are expected to exhibit a high level of motivation, cooperation and sportsmanship. Activities include strength training, speed development, mobility training and specific sport related drills, sports nutrition, supplements, dehydration and the abuse of steroids. This course will satisfy the requirement for a student’s grade-level physical education class. Students will take one marking period of Health Education as part of this course."
            }
        ]
    },
    {
        "title": "Mathematics",
        "offerings": [
            {
                "title": "ALGEBRA I (ADV, CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "ADV/HN Teacher Recommendation",
                "description": "This course for the college-bound student covers the major topics of elementary Algebra up to and including quadratics. Emphasis is placed upon basic manipulation of variables, solving equations and general competency in solving verbal problems. Students enrolled in any level of Algebra I will be required to take the NJSLA Algebra I assessment."
            },
            {
                "title": "ALGEBRA IA (CP)",
                "grades": "9",
                "pre-requisite": "None",
                "description": "This course provides students with a foundation in essential concepts of Algebra. Students will cover key topics from the first half of our Algebra I (CP) curriculum. Algebra IB (CP) will be taken the following year. Emphasis is placed on the real number system and its properties, as well as exploring the language of Algebra in various forms."
            },
            {
                "title": "ALGEBRA II (HN, ADV, CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "ADV/HN Teacher Recommendation",
                "description": "This is a continuation of Algebra I concepts with emphasis on operations with real and complex numbers, linear and quadratic equations, polynomials, and functions. Students enrolled in any level of Algebra II will be required to take the NJSLA Algebra II assessment."
            },
            {
                "title": "ALGEBRA CONCEPTS (SP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course covers the major topics of elementary Algebra. Emphasis is placed upon basic manipulation of variables, solving equations and general competency in solving verbal problems. Students enrolled in Algebra Concepts will be required to take the NJSLA Algebra I assessment."
            },
            {
                "title": "CALCULUS AB (AP, HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is intended to prepare students seeking a college education in a math-oriented field. The course is an in-depth treatment of extended mathematical concepts needed for the successful completion of a college Calculus course. Areas of discussion will include: limits, integration, volume and area applications, related rates, optimization problems and transcendental functions. AP Students are required to take the AP exam. This AP level is eligible for dual credit through Stockton University. College credits earned may be transferable to other colleges and institutions."
            },
            {
                "title": "CALCULUS BC (AP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed to extend the concepts covered in Calculus I. Students will prepare for the Calculus BC exam and also cover more advanced integration techniques and applications, infinite series, differential equations, arc length and surface of revolution and the shell method of computing volumes. Students are required to take the AP exam."
            },
            {
                "title": "SURVEY OF MATHEMATICS (CP)",
                "grades": "12",
                "pre-requisite": "None",
                "description": "This course is intended to build upon the skills learned in Algebra II. The knowledge and skills gained will prepare students for math courses at both 2-year and 4-year institutions. Topics include linear, rational, radical, polynomial, exponential and quadratic expressions, inequalities, linear systems, functions and their graphs. Select topics from conic section graphs and theory of equations will be explored. Placement into this course will be determined by performance in previous math courses and teacher recommendation."
            },
            {
                "title": "CONCEPTUAL ALGEBRA II (CP)",
                "grades": "12",
                "pre-requisite": "None",
                "description": "This course is designed for students who wish to develop stronger understanding of algebraic thinking so they can succeed in higher level mathematics. Students will apply concepts from first year Algebra and Geometry to solve real- world problems. Students will visualize, represent, model and solve problems that people encounter every day in areas such as science, art, and business. The focus will be on the modeling of linear and quadratic functions. Technology will play a major role in developing student understanding of these concepts."
            },
            {
                "title": "GEOMETRY (HN, ADV, CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This is a course designed for students who have successfully completed Algebra I. The course is designed to acquaint students with the proof of mathematical problems, relationships between points, lines, and planes and geometric shapes. Students enrolled in all levels of Geometry will be required to take the NJSLA Geometry assessment."
            },
            {
                "title": "GEOMETRY CONCEPTS (SP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This is a course designed for students who have successfully completed Algebra. The course is designed to acquaint students with relationships between points, lines, and planes and geometric shapes. Students enrolled in Geometry Concepts will be required to take the NJSLA Geometry assessment."
            },
            {
                "title": "MATH LAB: Alg I, Geometry, Alg II (B)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course is a targeted intervention to assist students in the skills tested on the PARCC (College and Career Readiness) Assessments. The online program, Edmentum, will provide opportunities to identify and address strengths and weaknesses in various mathematical topics. Data on student skill deficits will be tracked throughout the semester. Placement into this course will be determined by results on previous NJSLA Assessments and/or other school-based assessments."
            },
            {
                "title": "MATHEMATICS FOUNDATIONS (SP)",
                "grades": "12",
                "pre-requisite": "None",
                "description": "This course provides a preparation for more advanced study in mathematics, including Pre-Calculus, for students who seek to improve their algebra skills. This course will build on concepts from Algebra & Geometry including linear, quadratic, exponential, rational, polynomial and radical expressions, inequalities, equations, functions and their graphs. Students will also have the opportunity to strengthen mathematical skills necessary for state testing, ASVAB and college entrance examinations"
            },
            {
                "title": "PRE-CALCULUS (HN, ADV)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is intended to prepare students seeking a college education in a math-oriented field such as engineering or the sciences. The course is designed to assist the student in acquiring a basic knowledge of Calculus principles. Areas of discussion will include: functional notation, graphing, logarithms, trigonometry and matrices. This course is eligible for dual credit through Stockton University. College credits earned may be transferable to other colleges and institutions."
            },
            {
                "title": "STATISTICS (AP, HN, CP)",
                "grades": "10-11-12",
                "pre-requisite": " HN/AP Teacher Recommendation",
                "description": "The objectives of this course are to familiarize students with statistical terminology and tools for describing data sets. Students will also obtain knowledge of the concepts in data description, hypothesis testing, statistical inference and obtain a firm basis for further statistical study. Students will be exposed to the importance of the basic assumptions underlying all statistical calculations. AP students are required to take the AP exam. The Honor level course will be eligible for dual credit through Atlantic Cape Community College. College credits earned may be transferable to other colleges and institutions."
            }
        ]
    },
    {
        "title": "Science",
        "offerings": [
            {
                "title": "ANATOMY & PHYSIOLOGY (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This is an introductory course in human anatomy and physiology. The ability to develop and recall a large technical vocabulary and retain a large volume of detailed information is essential for success in this course. Anatomy and Physiology will cover cell structure and functions, tissues, homeostasis, and several body systems (integumentary, skeletal, muscular, nervous, senses, endocrine, cardiovascular, lymphatic, respiratory, digestive, and urinary). This course fulfills the pre- requisite for AP Biology."
            },
            {
                "title": "BIOLOGY (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The advanced placement biology course is for students who have successfully completed biology and chemistry and want a college level science course. The course is designed to follow the College Board AP Biology program. Successful students are encouraged to take the SAT Subject Test in Biology. This course may be offered as a dual credit course with Stockton University. Students are required to complete three independent studies: One over the summer prior to classes beginning in September, one over the Winter Break and one over Spring Break. Students are required to take the AP exam."
            },
            {
                "title": "BIOLOGY (HN)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "For the college-bound student, this course consists of an in-depth study of life. Students must be highly motivated to learn cellular and molecular biology. Topics of discussion and experimentation include: biochemistry, cellular structure & function, metabolism, genetics, heredity, evolution and ecology. Separate independent projects will also be required."
            },
            {
                "title": "BIOLOGY (ADV, CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course is designed for the college bound student. This course consists of an in-depth study of life. Topics of discussion and experimentation include: cellular structure & function, genetics, natural selection, botany (plant science), and ecology (environmental science)."
            },
            {
                "title": "BIOLOGY-GENERAL (SP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course that introduces the student to the study of life. Major topics covered in the course include cell structure, function, animals and plants, classification of living things, how organisms carry on life processes, heredity, the human body, diseases and the environment. Laboratory work is an integral part of the course as well as films, guest speakers, classroom discussion and microscope work."
            },
            {
                "title": "CHEMISTRY (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This advanced placement college prep course is designed to be equivalent to a first year college course in chemistry. Students can obtain college credit for this course by scoring well on the Chemistry AP Exam in the spring. In light of this, the AP Chemistry is a rigorous academic course that includes the following topics: inorganic nomenclature, solutions, gas laws, thermo chemistry, atomic structure, chemical bonding, chemical equilibrium, acid-base chemistry, kinetics, thermodynamics, electrochemistry, nuclear chemistry, and quantum chemistry. Students are required to take the AP exam."
            },
            {
                "title": "CHEMISTRY (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This advanced course requires students to master the basic skills of problem solving which necessitates the use of the scientific method and mathematics. Emphasis will be placed upon the application of knowledge in the synthesis of connections between concepts. Information regarding the use of techniques in industry and in the student’s home environment will be provided to give a sense of relevance and importance. Topics covered will give students an appreciation of the many areas of chemistry and a firm foundation to further build upon."
            },
            {
                "title": "CHEMISTRY (ADV, CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This course involves the study of interactions and changes of materials that make up the universe. Students will learn how to use algebra and arithmetic to solve word problems and conduct quantitative investigations of matter. Topics include atomic structure, the periodic table, chemical bonds, chemical reactions, acid/base chemistry and nuclear chemistry. The advanced level will focus on the principles of the chemical nature of matter, the history of chemistry, organizations of chemistry, formulas, and equations, chemical reactions and the states of matter. The advanced level includes an emphasis on mathematical applications."
            },
            {
                "title": "CORE SCIENCE (CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This is a college prep science course that deals with the core science standards in earth science and biology. Topics covered include anatomy, earth science, space science, meteorology, and human history."
            },
            {
                "title": "CORE SCIENCE (SP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This is a science course that deals with core science standards in physical science and biology. Topics include: physical science (chemistry, physics), universe, earth science, meteorology, paleontology, oceanography and anatomy."
            },
            {
                "title": "ENVIRONMENTAL SCIENCE (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The goal of the AP Environmental Science course is to provide students with the scientific principles, concepts, and methodologies required to understand the interrelationships of the natural world, to identify and analyze environmental problems both natural and human-made, to evaluate the relative risks associated with these problems, and to examine alternative solutions for resolving and preventing them. The students must be prepared to work outdoors for many of the labs. Students are required to take the AP exam."
            },
            {
                "title": "ENVIRONMENTAL SCIENCE (ADV) ",
                "grades": "11-12",
                "pre-requisite": "None",
                "description": "Environmental Science is the study of man’s interaction with nature to provide knowledge to maintain a healthy and sustainable environment. Major topics in this course include; environmental problems and scientific principles, ecological principles, human population & resources, environmental quality & pollution, land use, biodiversity, and conservation. Learn what you can do to protect the planet."
            },
            {
                "title": "OCEANOGRAPHY (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "An introduction to the chemistry, geology, physical and biological processes of the world’s oceans, marginal seas, and coastal zones. The multidisciplinary character of oceanography is stressed. Fundamental principles in all disciplines are introduced. The goal of this course is an integrated understanding of how the ocean works. Students will build underwater ROVs through the SeaPerch program. This course is eligible for dual credit through Stockton University. College credits earned may be transferable to other colleges and institutions."
            },
            {
                "title": "OCEANOGRAPHY (ADV)",
                "grades": "11-12",
                "pre-requisite": "None",
                "description": "For the college-bound student, this course describes the physical, chemical, and biological characteristics of the oceans. Special detail will be paid to the Atlantic Ocean and tidal marshes that provide the ocean with much of its animal life. Fieldwork will be an integral part of this course."
            },
            {
                "title": "OCEANOGRAPHY (SP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course describes the physical, chemical, and biological characteristics of the oceans. Special detail will be paid to the Atlantic Ocean and tidal marshes that provide the ocean with much of its animal life. Fieldwork will be an integral part of this course."
            },
            {
                "title": "PHYSICAL SCIENCE (SP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This physical science course deals with the basic components of the universe - matter, energy, space and time."
            },
            {
                "title": "PHYSICS C (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed to be equivalent to a first year college course in Physics. Students can obtain college credit for this course by scoring well on the Physics AP Exam in May. AP Physics is a rigorous academic course that includes the following topics: kinematics, Newton's Laws of Motion, work, energy, power, systems of particles, linear momentum, circular motion and rotation, oscillations and gravitation, electrostatics, conductors, capacitors, dielectrics, electric circuits, magnetic fields, and electromagnetism. Students are required to take the AP exam."
            },
            {
                "title": "PHYSICS I (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is equivalent to a first-semester college course in algebra-based physics. The course covers Newtonian mechanics including rotational dynamics and angular momentum, work, energy, power, waves and sound. It also introduces electric circuits. Students are required to take the AP exam."
            },
            {
                "title": "PHYSICS II (AP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is equivalent to a second-semester college course in algebra-based physics. The course covers fluid mechanics, thermodynamics, electricity, magnetism, optics and atomic and nuclear Physics. Students are required to take the AP exam."
            },
            {
                "title": "PHYSICS I (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This honors course is geared to the high achievers in math and science who are planning a career in engineering or similar pursuit. Topics include: measurement and problems solving velocity and acceleration using kinematics in one and two dimensions, universal gravitation, Newton’s Laws of Motion and forces, work, energy, power, systems of particles including waves and sound, linear momentum, circular motion, rotation, oscillations, gravitation, electrostatics, conductors, capacitors, dielectrics, electric circuits, potential difference."
            },
            {
                "title": "PHYSICS II (HN)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This Honors course examines the physical nature of the universe. Special detail will be paid to the application of knowledge learned. Every unit will require students to design, redesign and build a project applying the new skills learned in the unit. Topics of emphasis include trigonometry, graphical analysis of data, energy and its conservation, heat, kinetic theory, gas laws, static, current electricity, light waves, sound, reflection, refraction, atomic structure and radiation, nuclear fission and fusion and the electromagnetic spectrum."
            },
            {
                "title": "PHYSICS (ADV, CP)",
                "grades": "11-12",
                "pre-requisite": "None",
                "description": "This college prep course examines the physical nature of the universe. Special detail will be paid to the application of knowledge learned. Every unit will require students to design, redesign and build a project applying the new skills learned in the unit. Topics of emphasis include trigonometry, graphical analysis of data, motion in straight lines (kinematics), graphical analysis of motion, vectors, forces that do not cause motion (statics), forces that cause motion (dynamics), friction, momentum and its conservation, projectile motion, universal gravitation, work and power, energy and its conservation, waves, fluids."
            }
        ]
    },
    {
        "title": "Social Studies",
        "offerings": [
            {
                "title": "WORLD CULTURES (HN, ADV, CP, SP)",
                "grades": "9",
                "pre-requisite": "Teacher Recommendation",
                "description": "World Cultures is the study of the interrelationships of individuals, societies and cultures which helps students understand their world. Geographic, political, economic and religious aspects of varied cultures, past and present, will be analyzed, enhancing the student’s understanding of World History and the student’s appreciation for cultural differences and similarities that influence global affairs."
            },
            {
                "title": "WORLD HISTORY MODERN (AP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "AP World History is offered for the student who has advanced writing and analytical skills and wants to engage with not just the past of the United States and Europe but the entire world. The course covers global history and will explore regional connections from 1200 to 1450, the impact of the Columbian Exchange, the long nineteenth centure, and culminating in the horrific violence and incredible progress of the last century. Students will create, analyze and challenge historical narratives through historical thinking skills such as causation, comparison, change & continuity over time, and claim testing while exploring themes of human and the environment, governance, cultural developments, and economic systems. This course is comparable to an introductory college course in world history and prepares students for the spring World History Advanced Placement Exam. Students are required to take the AP exam"
            },
            {
                "title": "U.S. HISTORY I (HN, ADV, CP, SP)",
                "grades": "10",
                "pre-requisite": "HN/ADV Teacher Recommendation",
                "description": "U.S. History I provides the student with an overview of American history from the development of the U.S. government in the post-Revolutionary period to World War I. Social, economic, political and religious factors and their impact on American development are examined. Additionally, students will be acquainted with the principles, organization and functions of the American Government. Honors level is eligible for dual credit through ACCC. College credits earned may be transferable to other colleges and institutions."
            },
            {
                "title": "U.S. HISTORY II (HN, ADV, CP, SP)",
                "grades": "11",
                "pre-requisite": "Teacher Recommendation",
                "description": "United States History ll is a required social studies course for all students in the eleventh grade at Egg Harbor Township High School. The primary focus is to provide instruction leading to student acquisition of knowledge and understanding of the American experience. Of equal importance is the development of skills inherent in the social studies disciplines. United States History ll focuses on content areas that support and sequentially follow the United States History I course of study. The student will examine historic events and American life conditions for the time span beginning with the effects of World War I until the present day. In this process, the student will have the opportunity to focus on current issues that are related to each unit of study. In addition, the student will have the opportunity to critically analyze and evaluate major events in American History."
            },
            {
                "title": "U.S. HISTORY (AP)",
                "grades": "11",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course fulfills the U.S. History II requirement and will examine our country’s history in depth from 1880 to the present. It is highly recommended that the student has completed Honors U.S. History I as a background. A variety of texts, primary and secondary source materials and other learning tools will be used. The use of Internet resources will also be employed. There will be a large amount of both reading and writing in preparation for the AP exam. After sitting for the AP exams in May, students will engage in various activities and will complete a major research project that will help prepare students for the rigors of college research and writing. Students are required to take the AP exam."
            },
            {
                "title": "AFRICAN AMERICAN STUDIES (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Students will study the struggles and triumphs of people of West African descent in the Americas. You will consider their efforts to forge an identity within the American mainstream. In particular, you will study the contributions of African-Americans to American civilization in the fields of science, the arts and the humanities. Within historical context, you will analyze and discuss historical and literary sources. Students will engage in debates, lead and participate in class discussions as well as other performance assessments. This course is eligible for dual credit through Stockton University. College credits earned may be transferrable to other colleges and institutions."
            },
            {
                "title": "ART HISTORY (AP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This full year elective course begins with Prehistoric cave paintings and ends with contemporary pop art. Through PowerPoint presentations and virtual museum tours, students will study hundreds of art masterpieces and their masters in a chronological sequence. Students will learn about various art techniques, examine art from cultures around the world, and be able to see how and why the works of art function then and now. Although fun and interesting, the major focus of this course is intense preparation for the national AP Art History exam. Students are required to take the AP exam."
            },
            {
                "title": "CONTEMPORARY ISSUES (CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "Contemporary Issues is a lively, ever-changing look at our world, our community, and our nation. Student-driven and discussion based, topics include social and environmental issues, politics, and all other concerns challenging the 21st century student. Utilizing films, documentaries and a variety of internet and news sources, students are encouraged to form and express their opinions in an open-minded atmosphere."
            },
            {
                "title": "CRIMINAL & CIVIL LAW-INTRODUCTION (CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course covers the basic principles of American Civil and Criminal Law, the structure of the U.S. Court System and due process guidelines. Students will also analyze and debate current legal controversies, participate in mock trials and other role play simulations."
            },
            {
                "title": "ECONOMICS (CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "he national economy of the United States is a complex free market system and the world’s wealthiest country where the persistence of scarcity is evident in all classes. This course untangles some of the economy’s complexities by examining the laws that govern the U.S. economy and other economies around the world. At the same time, this course will focus on the specific mechanisms, finance, strengths and failures of the American free enterprise system. A balance of both microeconomic and macroeconomic topics will be covered in this course as well as personal financial planning. This course satisfies the NJ State graduation requirement for Financial Literacy."
            },
            {
                "title": "EUROPEAN HISTORY (AP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "AP European History is an academic year-long course covering European History from the Middle Ages to the present, that is meant to be the equivalent of a freshman college course and can earn the student college credit. The course covers the history of Europe from the end of the Middle Ages to the present day. Students are expected to do a considerable amount of reading in both the major text and the supplementary sources. Evidence of this reading is shown in class discussions, questions asked by the teacher, and answers to the teacher’s questions, as well as in unit tests, which consist of objective and essay type questions. Students should possess strong reading and writing skills and be willing to devote substantial time to study and completion of class assignments. The course is intended to dovetail the AP European History exam administered by the College Board. Students are required to take the AP exam."
            },
            {
                "title": "HOLOCAUST (HN) ",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Students will explore various aspects of genocide, human behavior, and crimes against humanity.The Holocaust will be the focus of about half of the course with the remainder devoted to contemporary genocidal issues as well as human rights. Current events will also be explored. A variety of learning and teaching techniques will be employed which include interpretation of primary and secondary source materials/accounts, projects, historical film and literature, and personal experiences of survivors. Guest speakers will be available as will outside events and other alternative means of assessment. This unique experiential class will also be devoted to preparing the student for the college experience. Students will develop the 21st century skills of critical thinking, communication, collaboration and creativity. This course is eligible for dual credit through Stockton University. College credits earned may be transferable to other colleges and institutions."
            },
            {
                "title": "MACROECONOMICS (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Advanced Placement Macroeconomics is a college-level course that introduces fundamental economic concepts such as scarcity and opportunity costs. Other primary components of the course will include basic economic concepts, measurement of economic performance, national income & price determination, the financial sector, inflation, unemployment and stabilization policies. Economic growth and the role to productivity will be examined as well as international trade & finance. Coverage of these concepts will provide students with the foundation for a thorough understanding of macroeconomic policies and issues. Students are required to take the AP exam. This course satisfies the NJ State graduation requirement for Financial Literacy."
            },
            {
                "title": "MICROECONOMICS (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Advanced Placement Microeconomics is a college-level course that gives students a thorough understanding of the principles of economics that apply to the functions of individual decision makers, both consumers and producers, within the economic system. It places primary emphasis on the nature and functions of product markets, and includes the study of factor markets and of the role of government in promoting greater efficiency and equity in the economy. The following topics will be covered: Basic Economic Concepts, The Nature and Functions of Product Markets, Factor Markets, and Market Failure & the Role of Government. Coverage of these concepts will provide students with the foundation for a thorough understanding of microeconomic policies and issues. Students are required to take the AP exam. This course satisfies the NJ State graduation requirement for Financial Literacy."
            },
            {
                "title": "PSYCHOLOGY (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendations",
                "description": "This course is intended to provide the student with a learning experience equivalent to that obtained in most college introductory psychology courses in preparation for the Advanced Placement Examination in Psychology. Topics emphasized include the following: methods, approaches and history of psychology, biological bases of behavior, sensation and perception, motivation and emotion, developmental psychology, abnormal psychology, treatment of psychological disorders, and social psychology. Students are required to take the AP exam."
            },
            {
                "title": "PSYCHOLOGY (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course presents a more detailed examination of the concepts of modern psychology and major psychological theory. Students practice the methods used by psychologists in real experiments and report their results using the format of the American Psychological Association. Topics include the psychological bases of behavior, learning, memory, abnormal behavior, and the treatment of the psychological disorders. This course is intended to prepare the student for the rigors of Advanced Placement Psychology."
            },
            {
                "title": "PSYCHOLOGY (CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This course is a basic study of the major areas and approaches in psychology. This course examines such topics as: historical approaches to psychology; brain and nervous system functions; life span development; learning, remembering, and thinking; interactions with the world and each other; why we are motivated to act as we do; factors that make each of us distinct individuals; stress; psychological disorders and treatment; careers in psychology. The course emphasizes scientific methodologies within the discipline."
            },
            {
                "title": "U.S. GOVERNMENT AND POLITICS (AP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Advanced Placement U.S. Government and Politics is equivalent to a college-level U.S. Government course covering the nuts and bolts of the American political system. The course covers the structure and operations of the U.S. Government and the behavior of the electorate and politicians. Students learn how to gather and analyze data about political behavior and form theories about how our political system acts as it does. Students should gain an analytic perspective, enabling them to critically evaluate political information, hypotheses, concepts, opinions and processes. The course will be valuable to students interested in politics, the social sciences, and law and is designed to prepare students for the AP Exam in U.S. Government and Politics. Students are required to take the AP exam."
                
            }
        ]
    },
    {
        "title": "Visual & Performing Arts  ",
        "offerings": [
            {
                "title": "CALLIGRAPHY/2D (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Calligraphy is the fine art of lettering. Students will learn how to make effective use of the design elements and principles to create works of art which incorporate text. Students will develop the process of making art with letters by using various pens, inks, brushes, and varied media. Mastery of several lettering styles will be achieved through repetition and the development of good work habits. Students must have the ability to work independently and to complete work in a timely manner. They will be expected to apply previous knowledge of concepts and techniques to new assignments. Students will be required to generate original ideas and demonstrate problem solving skills through the various stages of an assignment, resulting in highly creative works of art."
            },
            {
                "title": "ADVANCED CALLIGRAPHY/3D (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is a more advanced approach to using letterforms along with design concepts. Students will learn how to work with advanced paper techniques and use a mixed media approach. Emphasis will be placed upon the student’s ability to combine critical thinking skills with lettering techniques; advanced layout designs, binding and using varied lettering instruments. Various styles of book arts will be explored and incorporated with letterforms and media techniques. Students will be expected to exhibit their work at school/community art shows."
            },
            {
                "title": "CERAMICS (CP)",
                "grades": "11-12",
                "pre-requisite": "None",
                "description": "Introduction to Ceramics is a specialized course for the student interested in the clay forming processes, including the hand building forms of pinch, coil and slab, and wheel thrown pottery. Students will study both functional and sculptural aspects of clay forms."
            },
            {
                "title": "ADVANCED CERAMICS (HN)",
                "grades": "12",
                "pre-requisite": "HN Teacher Recommendation",
                "description": "Advanced Ceramics is a course for students who wish to further develop the skills they’ve learned in Introduction to Ceramics. Studio work in hand building ceramic construction techniques will be further developed as well as potter’s wheel techniques. Glaze applications, kilns, and various pieces of ceramics equipment will be studied. Students will be expected to exhibit their work at school/community art shows."
            },
            {
                "title": "DRAWING AND PAINTING (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Students will be introduced to studio art through an exploration of the elements and principles of design. This course is designed to initiate creative thinking and problem solving in the process of creating original art. Emphasis will be placed on two-dimensional art, such as drawing and painting, and the utilization of art history as a guideline for practice and theory. Students will be expected to exhibit their work at school/community art shows."
            },
            {
                "title": "ADVANCED DRAWING AND PAINTING (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This advanced course is for the serious art student who wishes to pursue a more in depth study of drawing, painting and design, as well as significant movements in art history. Problem solving and creative thinking, as well as the elements and principles of design, are explored more thoroughly and individually. Students will develop a greater sense of perceptual awareness through a series of artistic challenges that will result in self-expression through the use of various media and techniques. Students will be expected to exhibit their work at school/community art shows and keep a sketchbook."
            },
            {
                "title": "DIGITAL ART AND DESIGN (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Students learn basic animation theory and mechanics, develop observational and drawing skills and study the fundamental principles of character design, layout and storyboarding in this class. Students will work with two- dimensional and three-dimensional concepts through the exploration of the elements and principles of design. Assisted by the use of Adobe programs and Microsoft surface tablets, students will develop a greater understanding of how science, technology, engineering and math are integrating themselves into the art world today through the use of various technological components and digital art techniques. Units of study may include: digital art, photography, typography, book arts, STREAM inspired art, and digital printmaking. Students will be expected to exhibit their artwork at school/community art shows."
            },
            {
                "title": "ADVANCED DIGITAL ART AND DESIGN II (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Advanced Digital Art and Design is for the serious art student who wishes to pursue a more in depth study of digital art and animation. Problem solving and creative thinking, as well as the elements and principles of design, are explored more thoroughly and individually. Assisted by the use of Adobe Creative Cloud and Microsoft Surface Tablets students will be challenged to create various pieces of digital art, storyboards, animations, etc. Units of study may include: digital art, animation, typography, graphic design and STREAM inspired art. Students will be expected to keep a digital sketchbook, as well as, exhibit their artwork at school/community art shows."
            },
            {
                "title": "PORTFOLIO PREPARATION (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed for student to further their abilities to develop a suitable body of work for portfolio review. Each student will develop an exhibition of work and a portfolio suitable for career or college placement. An art gallery experience or museum visit may be part of this course. Student art work will be exhibited in both the Teen Arts and District-Wide Youth Art Month Festivals. Participation in the Honors Art Exhibition is required for this course."
            },
            {
                "title": "STUDIO ART (AP)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Studio art is designed for the highly motivated and serious student. Studio work will be stressed as well as discussion of art theory and analysis. Classical and contemporary approaches to drawing will be stressed with an emphasis on concept, composition, technique, and study of color/design/painting in a variety of media. Students will each choose from one of the three portfolio choices to focus on; 2D, Drawing, or 3D. Students will work to develop breadth, quality, and concentration pieces reflecting the chosen portfolio. Each student will devise an independent project organized around a theme or interest of their choosing and keep a sketchbook as a tool and record of development. Each student will develop an exhibition of work and a portfolio suitable for career or college placement. An art gallery experience or museum visit will be part of this course. Student art work will be exhibited in both the Teen Arts and District-Wide Youth Art Month Festivals. Participation in the Honors Art Exhibition is required for this course.Students are required to take the AP exam."
            },
            {
                "title": "BEGINNING MUSIC THEORY (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This class will include the fundamentals of: ear training, dictation, sight singing, interval & chord recognition, aural skills, keyboard harmony & composition. This course is the pre-requisite to AP Music Theory and is essential for instrumental & choral student musicians who plan to continue their music education after graduation."
            },
            {
                "title": "MUSIC THEORY (AP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is for the student who has demonstrated musicianship and performance skills as well as a working understanding of the fundamentals of music. Emphasis will be given to the development of aural, composition, performance, and analytical skills. Performance using students' primary media is part of the learning process. Students are required to take the AP exam."
            },
            {
                "title": "MUSIC APPRECIATION (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course will present to the student music of various Western and non-Western cultures and historical periods, including the creative process, the formal elements of music and musical styles, genre, and media. Contemporary styles of music will also be included for study. Attendance at some concerts may be required."
            },
            {
                "title": "DIGITAL PIANO LAB (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "The program is designed for students at all levels of piano instruction. No previous music experience is necessary. Students will learn to read music and to play simple through advanced selections in several keys. Skills will be developed through study of keyboard geography, basic terminology, musical notation, scales, rhythms, chords, simple transposition, harmonization, and improvisation. Students will be evaluated regularly through individual performance. Materials will stress basic musicianship, along with solo and ensemble repertoire. Students will receive a subscription to PLAYGROUND SESSIONS ® to assist in their instruction as well as for performance opportunities."
            },
            {
                "title": "DIGITAL RECORDING (CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "Students in this class will learn about and apply basic functions of digital recording and producing, using state-of-the- art DAW (Digital Audio Workstation). Students will also learn the basic functions of recording and will complete projects that will enable them to navigate the interface with a focus on audio editing, plug-ins and automation. Students must have previous experience singing, playing an instrument or recording music."
            },
            {
                "title": "CONCERT CHOIR (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course is offered to students interested in mastering basic choral elements of vocal music. Emphasis will also be on Developing the skills necessary to sing repertoire with confidence and expression Students will be required to prepare and perform in several school and community concerts. Occasional after-school and weekend rehearsals are also required. Students are required to perform in all school and community concerts. Grading will result from performance-based teacher assessment. This course is open to all students and may be repeated."
            },
            {
                "title": "CONCERT CHOIR/GOSPEL SECTION (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Concert Choir (Gospel Section)Choir will offer an introductory experience in the dynamics of performing choral literature from the Gospel Music tradition and is offered to students interested in singing a varied repertoire of music. The emphasis of this course will be on developing an understanding and skill in complex rhythm structure, phrasing and vocal production and intonation needed for singing Gospel Music Occasional after-school and weekend rehearsals are also required. Students are required to perform in all school and community concerts. Grading will result from performance-based teacher assessment. This course is open to all students and may be repeated."
            },
            {
                "title": "VOCAL ENSEMBLE (CP)",
                "grades": "10-11-12",
                "pre-requisite": "Audition",
                "description": "Vocal Ensemble is the premier singing group at EHTHS. Emphasis will be placed on individual musical achievement and growth as well as ensemble rehearsal & performance participation. Students will be expected to sing with good vocal technique; a varied repertoire of choral literature; and perform in all concerts Ensemble size is limited by sectional balance and restricted to the highest scores in each section. Choir and/or a background in piano or instrumental music, or vocal study is strongly recommended. Occasional after-school and weekend rehearsals are also required. Grading will result from performance-based teacher assessment. This course is by audition only and may be repeated."
            },
            {
                "title": "STRING ORCHESTRA (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The String Orchestra performs intermediate and advanced literature and is dedicated to developing and enhancing the skills of all string students. Students will develop technical proficiency on their instrument through daily classroom rehearsal activities. Individual practice and preparation outside of the classroom will be expected. Attendance and participation at all orchestra functions will be required, including rehearsals and concerts. Special activities may include eligibility to participate in region and state activities, and travel to regional, national and international festivals."
            },
            {
                "title": "STRING ORCHESTRA (HN)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The Honors Orchestra is the most advanced strings class at EHTHS and designed to provide experienced musicians the opportunity to perform a wide variety of advanced repertoire from different cultures and historical periods. Orchestra members are required to perform a minimum of two evening concerts throughout the year. Special activities may include and not be limited to regional and state activities, as well as district, national and international festivals. Students in Orchestra are encouraged to audition for All South Jersey Orchestra and will be asked to prepare the NJMEA- scales and solo requirements throughout the year. Students may also be called upon to serve as the string section of Symphony and Chamber Orchestras as well."
            },
            {
                "title": "SYMPHONIC BAND (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course will teach students individual and ensemble performance techniques on their chosen instrument at a beginning to intermediate level. Emphasis is placed on technique, the elements of music, and the performance of a variety of band music. The Symphonic Band members are required to perform at least two evening concerts throughout the year. Marching Band membership is preferred but not mandatory for this class."
            },
            {
                "title": "WIND ENSEMBLE (HN)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The Wind Ensemble is the most advanced band class at EHTHS and designed to provide experienced musicians the opportunity to perform a wide variety of advanced repertoire from different cultures and historical periods. Wind Ensemble members are required to perform a minimum of two evening concerts throughout the year. Special activities may include and not be limited to regional and state activities, as well as national and international festivals. Students in Wind Ensemble are encouraged to audition for All South Jersey Band and will be asked to prepare the NJMEA- scales and solo requirements throughout the year. Marching Band membership is preferred but not mandatory for this class. Students may also be called upon to serve as the Wind/Brass/Percussion section of the Orchestra."
            },
            {
                "title": "INTRODUCTION TO DANCE (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course is designed to inspire and instruct students in the fundamentals of dance. Jazz, Tap, Ballet, Modern, Musical Theater Dance for Stage and Film, Choreography and Dance for Music Videos, Hip Hop and Street will be explored. The history of dance and famous choreographers will also be a focus of this course. Students will be featured in a dance performance concert at the completion of their studies."
            },
            {
                "title": "ADVANCED DANCE (CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The audition consists of a ballet combination, double pirouetted, a jazz combination and tap combination (time steps). Skill technique and choreography are the focus of this course. Jazz, tap ballet, modern, musical theater dances for stage and film, the history of dance and famous choreographers will also be a focus of this course. Students will be featured in a dance performance concert at the completion of their studies."
            },
            {
                "title": "INTRODUCTION TO THEATER (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": " None",
                "description": "This course introduces the high school student to the world of theater production. Students will study the history of the theater, body language/movement, voice projection and articulation on the stage, the role of emotions in acting, character studies, stage movement/blocking, set use, props and costumes, and give short one-act performances."
            },
            {
                "title": "ADVANCED THEATER (CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed to inspire enthusiasm for the drama and to provide practical instruction in some of the techniques of the theater: stage production, voice projection, pantomime, make-up, and performance."
                
            }
        ]
    },
    {
        "title": "World Language ",
        "offerings": [
            {
                "title": "AMERICAN SIGN LANGUAGE (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "The new American Sign Language course will introduce students to fingerspelling, vocabulary, ASL grammar, and deaf culture. The course will teach students how to communicate with hearing impaired and deaf students without using their voice. This course will fulfill the NJ State World Language Requirement. Students pursuing a 4 year college/university will need to take 2-4 years of the same language, therefore this course may be taken in addition to another world language. Students selecting this as their first choice, must have a back-up language selection."
            },
            {
                "title": "FRENCH BASICS (B)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "This course is designed for students who would have difficulty succeeding in the CP French I course. Students who experience difficulty in reading comprehension or in writing should take this course. It will expose students to authentic French language and culture. The main emphasis will be on developing students’ oral proficiency at the Novice-Mid level.."
            },
            {
                "title": "FRENCH I (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Students will study French through 4 thematic units: Welcome Back to School; My Life After School; My House My World; and All Around the Town. They will begin to develop their ability to understand spoken and written French when viewing videos and listening to the spoken language as well as through reading the language. They will develop interpersonal skills by writing and speaking with their peers and with the teacher. Finally, they will present, orally and/or in writing, information, concepts and ideas to their classmates and teacher. Although it is not a pre-requisite, students who take Fundamentals of French in Middle School should take this course."
            },
            {
                "title": "FRENCH II (HN, CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "HN Teacher Recommendation",
                "description": "Students in this course will continue their study of French through 4 thematic units. Students in the Honors course will study units on shopping, travel, entertainment and history. Students in the CP course will study similar units on shopping, travel, and entertainment as well as units on the environment and conservation. The honors course will develop students' proficiency from the Intermediate-Low level to the Intermediate-Mid level. The class is conducted in French and students are expected to use the language orally in class. Students wishing to move from CPI to HNII must have a teacher recommendation"
            },
            {
                "title": "FRENCH III (HN, CP)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "In this accelerated course, instruction is in French and students are expected to use the language daily. The goal of the honors course is to develop students’ proficiency within the Intermediate-Mid level. Proficiency development in the CP course is at the Intermediate-Low level. Students in the honors level will begin to read novels in French this year with guidance, including the classic Le Petit Prince. Students will study units on French art and nutrition. They will learn to consider Francophile perspectives and to compare them to American perspectives. Students who complete CP III may take HN III with a teacher recommendation and demonstrated proficiency at or beyond the Intermediate- Low level. The honors level will be offered as Dual Credit through ACCC. College credits earned may be transferable to other colleges and institutions. See pg. 11 for additional details."
            },
            {
                "title": "FRENCH IV (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This is a communicative course for students wishing to develop their proficiency in French at the Intermediate-Mid/High level. The three modes of communication (Interpretive, Interpersonal, Presentational) and the study of the products, practices and perspectives of French-speaking people are integral parts of the course. Students analyze, reflect on, and discuss contemporary issues. They read Francophone literature, and write emails and essays. During the course of the year, the student will explore a variety of media: film, television and radio broadcasts, newspaper and magazine articles from Francophone publications, classical and popular music as well as literary texts. The class is conducted entirely in French and students must express themselves in French. This course is mandatory for junior students planning to take the AP French class during their senior year. This course will be offered as Dual Credit through ACCC. College credits earned may be transferable to other colleges and institutions. Seniors are eligible to graduate with the Seal of Biliteracy upon successful completion of the AAPPL at the Intermediate-Mid or better level. See page 11-12 for additional details."
            },
            {
                "title": "FRENCH V (AP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The AP French Language and Culture course is designed to promote proficiency in French and to enable students to explore culture in contemporary and historical contexts. The course focuses on interpersonal, interpretive and presentational communication with the goal of developing proficiency at the Intermediate-High or Advanced Low proficiency level. Students will develop their reading, writing, listening and speaking skills while expanding their awareness of the cultural products, practices, and perspectives of the Francophone world. The AP French Language and Culture exam will focus on the following themes: Global Challenges, Science and Technology, Contemporary Life, Personal and Public Identities, Families and Communities, and Beauty and Aesthetics. These themes will be heavily integrated into the class to thoroughly prepare students for the exam. In addition to textbooks, materials include websites, podcasts, films, newspapers, magazines, and literature. Students should recognize that successful completion of this course requires significant outside work and diligent class preparation. Students are required to take the AP exam. Seniors are eligible to graduate with the Seal of Biliteracy upon successful completion of the AAPPL at the Intermediate-Mid or better level. See page 12 for additional details."
            },
            {
                "title": "GERMAN I (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Students in this course will begin their study of German through 4 thematic units: Welcome Back to School; My Life After School; My House & My World and All Around the Town. Students will develop the ability to understand spoken German through multimedia material. They will develop Novice-level interpersonal skills by writing and speaking with their peers and with the teacher. Finally, they will present, orally and/or in writing, information, concepts and ideas to their classmates and teacher. Students will study holidays, cultural events and everyday culture of German teenagers. Students are guided to make cultural comparisons between Germany and the United States. Students’ novice-level language and literacy skills will be enhanced through authentic German readings. Students are required to keep their notebooks and binders for the duration of the course as their primary reference materials."
            },
            {
                "title": "GERMAN II (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course refines the skills the students learned in German I and takes the student into the world of a German teenager in four units: Let’s Go Shopping, Let’s Take a Trip; Entertain Me, and A Slice of History. The goal of this course is to develop students’ proficiency at the Novice High level. Spoken German will be used in the classroom. Students will read and listen to various authentic stories, make presentations to the class to develop and demonstrate an understanding and appreciation for culture in Germany, and write journal entries and creative stories in German to expand communication and literacy skills. Culture will include the study of major holidays in Germany, foods, fashion, media, film, music and literature. Multimedia material will be used to generate discussions of cultural comparisons. Students will create a culture book from this year's work. Students are encouraged to participate in the AATG National German Exams."
            },
            {
                "title": "GERMAN III (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The goal of this course is to develop students’ proficiency from the Novice High level to the Intermediate Low level. This is done through four units: Childhood Memories, Health and Nutrition, Art and Culture, and A Novel and a Movie. Students' interpretive, interpersonal, and presentational skills will be expanded through daily use of the language and multi-media components. Students will be expected to use the language in class. Students are required to do German work at home in preparation for the class. Students will explore German history and novels. Students will keep journals in German and create a multimedia project to show their language and literacy skills. Students will begin to prepare for the AP Level course. Students are encouraged to participate in the AATG National German Exams, German Language Day, and various cultural events in the surrounding area."
            },
            {
                "title": "GERMAN IV (AP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed as a cooperative group-seminar and as preparation for the AP Exam for students who successfully completed HN German III or who demonstrate Intermediate proficiency in oral and written German. The three modes of communication (Interpretive, Interpersonal, Presentational) and the study of the products, practices and perspectives of German-speaking people are integral parts of the course. Students analyze, reflect on, and discuss contemporary issues. Students study and develop the skills to analyze German literature, to read German novels, to listen to German music, and to watch German media presentations and classic films. Students will complete a study of German literature as it relates to history and culture to show their language and literacy skills. Students are encouraged to participate in the AATG National German Exams, German Language Day and attend various cultural events in the surrounding area. Students are required to take the AP exam. Seniors are eligible to graduate with the Seal of Biliteracy upon successful completion of the AAPPL at the Intermediate-Mid or better level. See page 12 for additional details."
            },
            {
                "title": "LATIN I (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "The study of Latin helps students to think logically and is helpful in career choices such as medicine and law. In this course, students will be introduced to the basic pronunciation, grammar and vocabulary of the Latin language. The conjugation of verbs and the declension of nouns will be studied in contextual situations. In order to make use of the language, some emphasis will be placed on speaking Latin. One of the most useful aspects of the course is the development of English vocabulary from Latin root words. The contributions to and influence of Roman civilization on our modern society and western languages will also be highlighted."
            },
            {
                "title": "LATIN II (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course will begin with an intensive review of vocabulary and grammar learned in Latin 1, including the six tenses, active and passive. It will cover the four tenses of the subjunctive as well as more complex sentences, such as indirect statement, indirect question, result, relative, and purpose clauses. This course will continue to present Latin mottos, cultural life and mythical and historical personages but in more depth. Students will examine a wide selection of passages from both ancient and medieval authors. This will prepare students for reading ancient authors such as Caesar, Cicero, and Ovid in the third year."
            },
            {
                "title": "LATIN III (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course will review all grammatical structures covered in Latin II, with an emphasis on more complex sentence structures, the use of the subjunctive in subordinate clauses, and an introduction to meter. Students will be introduced to some original texts, principally Caesar, but will include other Classical authors such as Cicero or Ovid. The course will cover mythological and historical figures as in Latin I and II, as well as mottos."
            },
            {
                "title": "LATIN IV (AP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "In the fourth year of Latin, students will use the texts Virgil’s Aeneid and Caesar’s De Bello Gallico to prepare for the AP Latin exam. Students will study language, culture and history as well as the literature of the Aeneid and De Bello Gallico. English, as well as Latin writing skills, will be reinforced through an analysis of the historical perspectives, imagery, stylistic devices and meter used in Roman poetry. Listening and speaking skills will continue to be developed. Students are expected to participate in the National Latin Exam, the Medusa Mythology Exam and Certamen, a statewide Latin academic competition. Students are required to take the AP exam. Seniors are eligible to graduate with the Seal of Biliteracy upon successful completion of the AAPPL at the Intermediate-Mid or better level. See page 12 for additional details."
            },
            {
                "title": "SPANISH I (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "None",
                "description": "Students will study Spanish through 4 thematic units: Welcome Back to School; My Life After School; My House & My World and All Around the Town. They will develop their ability to understand spoken and written Spanish when viewing videos and listening to the spoken language as well as through reading the language. They will develop interpersonal skills by writing and speaking with their peers and with the teacher. Finally, they will present, orally and/or in writing, information, concepts and ideas to their classmates and teacher. Although it is not a pre-requisite, students who take Fundamentals of Spanish in Middle School should take this course."
            },
            {
                "title": "SPANISH BASICS (B)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed for students who would have difficulty succeeding in the Spanish 1A course. Students who experience difficulty in reading comprehension or in writing should take this course. It will expose students to basic elements of the Spanish language and culture with a main emphasis on developing students’ oral proficiency. This course is not intended for Spanish speakers."
            },
            {
                "title": "SPANISH II (HN)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "Students in this course will continue their study of Spanish through 4 thematic units: shopping, travel, entertainment and history. The goal is to develop students' proficiency at the Intermediate-Mid level. Additionally, this course incorporates a unit on history taught in Spanish. The class is conducted in Spanish and students are expected to use the language orally in class. Students wishing to move from CP I to HN II must have a teacher recommendation and complete summer work."
            },
            {
                "title": "SPANISH II (CP)",
                "grades": "9-10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "In this course students will continue developing their skills in Spanish through new thematic units: Let’s Go Shopping, Entertainment, Let’s Take a Trip, and Ecotourism and Conservation. Students will continue developing their ability to understand spoken and written Spanish as they explore new topics in Spanish. They will write to and speak with their peers and the teacher in Spanish and they will give oral presentations in Spanish. The goal of the course is to help students reach the Intermediate-low proficiency level."
            },
            {
                "title": "SPANISH III (HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "The goal of this honors course is to develop students’ proficiency within the Intermediate-Mid level. In this accelerated course instruction is in Spanish and students are expected to utilize the language daily. Students will begin to read short stories and novels in Spanish this year with guidance. Students will study units on Spanish art, music, health and nutrition. They will begin to learn to critique in Spanish, analyze literary and artistic genres, write creatively, and compare a novel with a film. Students wishing to move from CP II to HN III must have a teacher recommendation, must complete summer work, and must demonstrate proficiency at the Intermediate-Low level. This course will be offered as Dual Credit through ACCC. College credits earned may be transferable to other colleges and institutions. See pg. 11 for additional details."
            },
            {
                "title": "SPANISH III (CP)",
                "grades": "10-11-12",
                "pre-requisite": "None",
                "description": "This Spanish course will focus on developing students’ proficiency through four thematic units: Daily Routines, When We Were Little, and Once Upon a Time. The main objective of the course is to develop students’ proficiency within the Intermediate-Low level. Students' interpretive, interpersonal, and presentational skills will be expanded through daily use of the language and multi-media components. Students are expected to use the Spanish language in class."
            },
            {
                "title": "SPANISH IV (HN)",
                "grades": "11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This is a communicative course for students wishing to develop their proficiency in Spanish at the Intermediate mid/high level. The three modes of communication (Interpretive, Interpersonal, Presentational) and the study of the cultures of Spanish-speaking people are integral parts of the course. Students will learn to interpret key information from authentic conversations and informational texts. They will develop their ability to exchange information and ideas and to present information in Spanish. Instruction is in Spanish and students are expected to utilize the language daily. This course is mandatory for junior students planning to take the AP Spanish Language class during their senior year. This course will be offered as Dual Credit through ACCC. College credits earned may be transferable to other colleges and institutions. Seniors are eligible to graduate with the Seal of Biliteracy upon successful completion of the AAPPL at the Intermediate-Mid or better level. See page 11-12 for additional details."
            },
            {
                "title": "SPANISH IV (CP)",
                "grades": "11-12",
                "pre-requisite": "None",
                "description": "The main objective is to develop students’ proficiency toward the Intermediate-Mid level. Students' interpretive, interpersonal, and presentational skills will be further expanded through daily use of the language and multi-media components. Students will study four thematic units: Art, Nutrition, Future Goals and Professions, and Music and will have many opportunities to develop their language skills through conversation and writing. Students are expected to use the Spanish language in class. Seniors are eligible to graduate with the Seal of Biliteracy upon successful completion of the AAPPL at the Intermediate-Mid or better level. See page 12 for additional details."
            },
            {
                "title": "SPANISH V (AP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is intended to prepare students for the AP Spanish Language exam through practice and guidance in each of the categories tested in that exam. It is comparable to third-year university courses that focus on speaking and writing at an advanced level. It is designed to equip the student with advanced proficiency in listening to, reading, writing, and speaking the Spanish language. Using authentic sources in Spanish and texts to review grammar and vocabulary, the students develop a command of Spanish linguistic skills, including accuracy and fluency, which support communicative ability. They will learn to identify, summarize, and synthesize the main points of spoken and written authentic sources. Students will present in spoken or written form their analyses, reactions, and/or opinions with respect to those main points. The AP Spanish Language exam will focus on the following themes: Global Challenges, Science and Technology, Contemporary Life, Personal and Public Identities, Families and Communities, and Beauty and Aesthetics. These themes will be heavily integrated into the class to thoroughly prepare students for the exam. Students are required to take the AP exam. Seniors are eligible to graduate with the Seal of Biliteracy upon successful completion of the AAPPL at the Intermediate-Mid or better level. See page 12 for additional detail."
            },
            {
                "title": "HISPANOHABLANTES I (CP, HN)",
                "grades": "9-10-11-12",
                "pre-requisite": " HN Teacher Recommendation",
                "description": "This course is designed for Spanish speaking students. Students will develop their literacy skills through thematic units, such as: Identity, Literary Resources, and Politics. Students will also study a unit on Financial Literacy in which they will have an opportunity to create a budget. Students will read poetry and both literary/informational texts in Spanish and will develop writing skills at the Intermediate-low/mid proficiency level. Spanish speaking students are encouraged to take this course instead of the traditional course. It is recommended that students have the ability to read some in Spanish."
            },
            {
                "title": "HISPANOHABLANTES II (CP, HN)",
                "grades": "10-11-12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course is designed for Spanish speaking students who have successfully completed Level I. In this second year students will develop their proficiency at the Intermediate-Mid level. Students will learn about modern issues facing Hispanic families in the USA, they will examine various professional life goals and will set goals for themselves, students will develop their literary proficiency through reading Hispanic legends and build on their knowledge of literary genres. More attention is paid to students’ written Spanish in this course as students learn to refine their writing skills."
            },
            {
                "title": "HISPANOBLANTES III (CP, HN)",
                "grades": "11-12",
                "pre-requisite": "HN Teacher Recommendation",
                "description": "This course will survey literary works in Spanish from Latin America, the Caribbean, and Spain, as well as films from all three regions. In this course students will learn to make literary analyses of the novels and short stories read in class, make cultural analyses of the films watched, and find thematic connections between such literature and cinema. Furthermore, the course will discuss the Hispanic/Latino culture, its relevant issues, and its impact on North American culture. Students will develop their critical thinking skills and writing in Spanish. Seniors are eligible to graduate with the Seal of Biliteracy upon successful completion of the AAPPL at the Intermediate-Mid or better level. See page 12 for additional details."
            },
            {
                "title":"AP SPANISH LITERATURE (AP)",
                "grades": "12",
                "pre-requisite": "Teacher Recommendation",
                "description": "This course focuses on major myths from around the world including creation, fertility, and hero myths. Cross-cultural comparisons and similarities will be examined as well as issues that unite human beings around the globe and through time. Mythology will include myths from Rome, Greece, the Middle East, Europe, the British Isles, the Far East, and the Americas."
            }
        ]
    }
]
    


